OpenFOAM/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    Inlet
    {
        type            fixedValue;
        value           uniform (10 0 0);
    }

    Outlet
    {
        type            zeroGradient;
    }

    Up
    {
        type            fixedValue;
        value           uniform (10 0 0);
    }

    Down
    {
        type            fixedValue;
        value           uniform (10 0 0);
    }

    Left
    {
        type            fixedValue;
        value           uniform (10 0 0);
    }
    
    Right
    {
        type            fixedValue;
        value           uniform (10 0 0);
    }
    
    Body
    {
        type            fixedValue;
        value           uniform (10 0 0);
    }

}

// ************************************************************************* //
