OpenFOAM/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    Inlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    Outlet
    {
        type            zeroGradient;
    }

    Up
    {
        type            zeroGradient;
    }

    Down
    {
        type            zeroGradient;
    }
    Left
    {
        type            zeroGradient;
    }

    Right
    {
        type            zeroGradient;
    }
    Body
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
