OpenFOAM/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    Outlet
    {
        type            patch;
        nFaces          8;
        startFace       1310500;
    }
    Up
    {
        type            patch;
        nFaces          60;
        startFace       1310508;
    }
    Left
    {
        type            patch;
        nFaces          105;
        startFace       1310568;
    }
    Right
    {
        type            patch;
        nFaces          105;
        startFace       1310673;
    }
    Inlet
    {
        type            patch;
        nFaces          9;
        startFace       1310778;
    }
    Down
    {
        type            patch;
        nFaces          1001;
        startFace       1310787;
    }
    Body
    {
        type            wall;
        nFaces          35796;
        startFace       1311788;
    }
)

// ************************************************************************* //
